//console.log(`Hello,world!`);

/* Задание 1 Текст задания
1. Создайте переменную num и присвойте ей значение 123. Выведите
значение этой переменной в консоль
2. Создайте переменную а и присвойте ей значение 5, переопределите
переменную а на значение 7, выведите переменную а в консоль
3. Создайте переменную b. Запишите в нее сумму чисел 1, 2 и 3. С
помощью функции console.log выведите в консоль содержимое
переменной b.
4. Создайте 2 вида комментариев в вашем коде, добавьте в них
произвольный текст*/

/*let num = 123;
let a = 5;
a = 7; 
console.log(a);

let b;
console.log(b);
b = 1 + 2 + 3;
console.log(b);

let c = null;
console.log(c);
*/

/*Задание 2
1. Создайте переменную c со значением 10 и переменную d со
значением 2.
a. Все созданные переменные должны быть логично названы
b. Создайте переменную суммы и присвойте сумму чисел (c,d)
c. Создайте переменную разности и присвойте разность чисел
(c,d)
d. Создайте переменную прозведения и присвойте произведение
чисел (c,d)
e. Создайте переменную частного и присвойте деление чисел
(c,d)
f. Выведите в консоль все созданные переменные
g. Сложите все созданные переменные и выведите результат в
консоль*/

/*const c = 10;
const d = 2;
let sum = c + d;
let difference = c - d;
let prod = c * d;
let division = c / d;
console.log(sum, difference, prod, division);
console.log(sum + difference + prod + division);
*/

/* Задание 3. Не запуская код, определите, что выведется в консоль:
a. let a = 5 + 5 * 3 + 3;
2. Не запуская код, определите, что выведется в консоль:
a. let a = 8 / 2 + 2;
3. Не запуская код, определите, что выведется в консоль:
a. let a = (2 + 3) * (2 + 3);
4. Не запуская код, определите, что выведется в консоль:
a. let a = (2 + 3) * 2 + 3;
5. Не запуская код, определите, что выведется в консоль:
a. let a = (2 * 8) / 4;
6. Не запуская код, определите, что выведется в консоль:
a. let a = 2 * (8 / 4);

/*Задание 4 (тайминг 5 минут)
1. Запишите в переменную a число 1.5, а в переменную b - число 0.75.
Найдите сумму значений этих переменных и выведите ее на экран.
2. Создайте переменную a, запишите в нее какое-нибудь
положительное или отрицательное число. Выведите на экран это
число с обратным знаком.*/
/*
let a = 1.5;
let b = 0.75;
console.log(a + b);
 a = 10;
 console.log(-a);
 */

 /*Задание5
1. Создайте строку с вашем именем и строку с вашей фамилией.
Выведите эти данные в консоль
2. Создайте переменную с текстом 'java' и переменную с текстом
'script'. С помощью этих переменных и операции сложения строк
выведите в консоль строку 'javascript'.
3. Создайте переменную с текстом 'hello' и переменную с текстом
'world'. С помощью этих переменных и операции сложения строк
выведите в консоль строку 'hello world'.
*/

const firstName = "Galya";
const lastName = "Mamedova";
console.log(firstName, lastName);

const java = "java";
const script = "script";
console.log(java + script);

const a = "hello";
const b = "world";
console.log(a + " " + b);